Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: يستعجل بها الذين لا يؤمنون بها والذين آمنوا مشفقون منها ويعلمون أنها الحق ألا إن الذين يمارون في الساعة لفي ضلال بعيد
en: Those who do not believe in it are impatient for it, but those who believe are fearful of it and know that it is the truth. Unquestionably, those who dispute concerning the Hour are in extreme error.

source: الله لطيف بعباده يرزق من يشاء وهو القوي العزيز
en: Allah is Subtle with His servants; He gives provisions to whom He wills. And He is the Powerful, the Exalted in Might.

source: من كان يريد حرث الآخرة نزد له في حرثه ومن كان يريد حرث الدنيا نؤته منها وما له في الآخرة من نصيب
en: Whoever desires the harvest of the Hereafter - We increase for him in his harvest. And whoever desires the harvest of this world - We give him thereof, but there is not for him in the Hereafter any share.

source: أم لهم شركاء شرعوا لهم من الدين ما لم يأذن به الله ولولا كلمة الفصل لقضي بينهم وإن الظالمين لهم عذاب أليم
en: Or have they other deities who have ordained for them a religion to which Allah has not consented? But if not for the decisive word, it would have been concluded between them. And indeed, the wrongdoers will have a painful punishment.

source: ترى الظالمين مشفقين مما كسبوا وهو واقع بهم والذين آمنوا وعملوا الصالحات في روضات الجنات لهم ما يشاءون عند ربهم ذلك هو الفضل الكبير
en: You will see the wrongdoers fearful of what they have earned, and it will [certainly] befall them. And those who have believed and done righteous deeds will be in lush regions of the gardens [in Paradise] having whatever they will in the presence of their Lord. That is what is the great bounty.

source: ذلك الذي يبشر الله عباده الذين آمنوا وعملوا الصالحات قل لا أسألكم عليه أجرا إلا المودة في القربى ومن يقترف حسنة نزد له فيها حسنا إن الله غفور شكور
en: It is that of which Allah gives good tidings to His servants who believe and do righteous deeds. Say, [O Muhammad], "I do not ask you for this message any payment [but] only good will through kinship." And whoever commits a good deed - We will increase for him good therein. Indeed, Allah is Forgiving and Appreciative.

source: أم يقولون افترى على الله كذبا فإن يشإ الله يختم على قلبك ويمح الله الباطل ويحق الحق بكلماته إنه عليم بذات الصدور
en: Or do they say, "He has invented about Allah a lie"? But if Allah willed, He could seal over your heart. And Allah eliminates falsehood and establishes the truth by His words. Indeed, He is Knowing of that within the breasts.

source: وهو الذي يقبل التوبة عن عباده ويعفو عن السيئات ويعلم ما تفعلون
en: And it is He who accepts repentance from his servants and pardons misdeeds, and He knows what you do.

source: ويستجيب الذين آمنوا وعملوا الصالحات ويزيدهم من فضله والكافرون لهم عذاب شديد
en: And He answers [the supplication of] those who have believed and done righteous deeds and increases [for] them from His bounty. But the disbelievers will have a severe punishment.

source: ولو بسط الله الرزق لعباده لبغوا في الأرض ولكن ينزل بقدر ما يشاء إنه بعباده خبير بصير
en: And if Allah had extended [excessively] provision for His servants, they would have committed tyranny throughout the earth. But He sends [it] down in an amount which He wills. Indeed He is, of His servants, Acquainted and Seeing.

source: وهو الذي ينزل الغيث من بعد ما قنطوا وينشر رحمته وهو الولي الحميد
en: And it is He who sends down the rain after they had despaired and spreads His mercy. And He is the Protector, the Praiseworthy.

source: ومن آياته خلق السماوات والأرض وما بث فيهما من دابة وهو على جمعهم إذا يشاء قدير
en: And of his signs is the creation of the heavens and earth and what He has dispersed throughout them of creatures. And He, for gathering them when He wills, is competent.

source: وما أصابكم من مصيبة فبما كسبت أيديكم ويعفو عن كثير
en: And whatever strikes you of disaster - it is for what your hands have earned; but He pardons much.

source: وما أنتم بمعجزين في الأرض وما لكم من دون الله من ولي ولا نصير
en: And you will not cause failure [to Allah] upon the earth. And you have not besides Allah any protector or helper.

source: ومن آياته الجوار في البحر كالأعلام
en: And of His signs are the ships in the sea, like mountains.

source: إن يشأ يسكن الريح فيظللن رواكد على ظهره إن في ذلك لآيات لكل صبار شكور
en: If He willed, He could still the wind, and they would remain motionless on its surface. Indeed in that are signs for everyone patient and grateful.

source: أو يوبقهن بما كسبوا ويعف عن كثير
en: Or He could destroy them for what they earned; but He pardons much.

source: ويعلم الذين يجادلون في آياتنا ما لهم من محيص
en: And [that is so] those who dispute concerning Our signs may know that for them there is no place of escape.

source: فما أوتيتم من شيء فمتاع الحياة الدنيا وما عند الله خير وأبقى للذين آمنوا وعلى ربهم يتوكلون
en: So whatever thing you have been given - it is but [for] enjoyment of the worldly life. But what is with Allah is better and more lasting for those who have believed and upon their Lord rely

source: والذين يجتنبون كبائر الإثم والفواحش وإذا ما غضبوا هم يغفرون
en: And those who avoid the major sins and immoralities, and when they are angry, they forgive,

source: والذين استجابوا لربهم وأقاموا الصلاة وأمرهم شورى بينهم ومما رزقناهم ينفقون
en: And those who have responded to their lord and established prayer and whose affair is [determined by] consultation among themselves, and from what We have provided them, they spend.

source: والذين إذا أصابهم البغي هم ينتصرون
en: And those who, when tyranny strikes them, they defend themselves,

source: وجزاء سيئة سيئة مثلها فمن عفا وأصلح فأجره على الله إنه لا يحب الظالمين
en: And the retribution for an evil act is an evil one like it, but whoever pardons and makes reconciliation - his reward is [due] from Allah. Indeed, He does not like wrongdoers.

source: ولمن انتصر بعد ظلمه فأولئك ما عليهم من سبيل
en: And whoever avenges himself after having been wronged - those have not upon them any cause [for blame].

source: إنما السبيل على الذين يظلمون الناس ويبغون في الأرض بغير الحق أولئك لهم عذاب أليم
en: The cause is only against the ones who wrong the people and tyrannize upon the earth without right. Those will have a painful punishment.

source: ولمن صبر وغفر إن ذلك لمن عزم الأمور
en: And whoever is patient and forgives - indeed, that is of the matters [requiring] determination.

source: ومن يضلل الله فما له من ولي من بعده وترى الظالمين لما رأوا العذاب يقولون هل إلى مرد من سبيل
en: And he whom Allah sends astray - for him there is no protector beyond Him. And you will see the wrongdoers, when they see the punishment, saying, "Is there for return [to the former world] any way?"

source: وتراهم يعرضون عليها خاشعين من الذل ينظرون من طرف خفي وقال الذين آمنوا إن الخاسرين الذين خسروا أنفسهم وأهليهم يوم القيامة ألا إن الظالمين في عذاب مقيم
en: And you will see them being exposed to the Fire, humbled from humiliation, looking from [behind] a covert glance. And those who had believed will say, "Indeed, the [true] losers are the ones who lost themselves and their families on the Day of Resurrection. Unquestionably, the wrongdoers are in an enduring punishment."

source: وما كان لهم من أولياء ينصرونهم من دون الله ومن يضلل الله فما له من سبيل
en: And there will not be for them any allies to aid them other than Allah. And whoever Allah sends astray - for him there is no way.

source: استجيبوا لربكم من قبل أن يأتي يوم لا مرد له من الله ما لكم من ملجإ يومئذ وما لكم من نكير
en: Respond to your Lord before a Day comes from Allah of which there is no repelling. No refuge will you have that day, nor for you will there be any denial.

source: فإن أعرضوا فما أرسلناك عليهم حفيظا إن عليك إلا البلاغ وإنا إذا أذقنا الإنسان منا رحمة فرح بها وإن تصبهم سيئة بما قدمت أيديهم فإن الإنسان كفور
en: But if they turn away - then We have not sent you, [O Muhammad], over them as a guardian; upon you is only [the duty of] notification. And indeed, when We let man taste mercy from us, he rejoices in it; but if evil afflicts him for what his hands have put forth, then indeed, man is ungrateful.

source: لله ملك السماوات والأرض يخلق ما يشاء يهب لمن يشاء إناثا ويهب لمن يشاء الذكور
en: To Allah belongs the dominion of the heavens and the earth; He creates what he wills. He gives to whom He wills female [children], and He gives to whom He wills males.

source: أو يزوجهم ذكرانا وإناثا ويجعل من يشاء عقيما إنه عليم قدير
en: Or He makes them [both] males and females, and He renders whom He wills barren. Indeed, He is Knowing and Competent.

source: وما كان لبشر أن يكلمه الله إلا وحيا أو من وراء حجاب أو يرسل رسولا فيوحي بإذنه ما يشاء إنه علي حكيم
en: And it is not for any human being that Allah should speak to him except by revelation or from behind a partition or that He sends a messenger to reveal, by His permission, what He wills. Indeed, He is Most High and Wise.

source: وكذلك أوحينا إليك روحا من أمرنا ما كنت تدري ما الكتاب ولا الإيمان ولكن جعلناه نورا نهدي به من نشاء من عبادنا وإنك لتهدي إلى صراط مستقيم
en: And thus We have revealed to you an inspiration of Our command. You did not know what is the Book or [what is] faith, but We have made it a light by which We guide whom We will of Our servants. And indeed, [O Muhammad], you guide to a straight path -

source: صراط الله الذي له ما في السماوات وما في الأرض ألا إلى الله تصير الأمور
en: The path of Allah, to whom belongs whatever is in the heavens and whatever is on the earth. Unquestionably, to Allah do [all] matters evolve.

source: والكتاب المبين
en: By the clear Book,

source: إنا جعلناه قرآنا عربيا لعلكم تعقلون
en: Indeed, We have made it an Arabic Qur'an that you might understand.

source: وإنه في أم الكتاب لدينا لعلي حكيم
en: And indeed it is, in the Mother of the Book with Us, exalted and full of wisdom.

source: أفنضرب عنكم الذكر صفحا أن كنتم قوما مسرفين
en: Then should We turn the message away, disregarding you, because you are a transgressing people?

source: وكم أرسلنا من نبي في الأولين
en: And how many a prophet We sent among the former peoples,

source: وما يأتيهم من نبي إلا كانوا به يستهزئون
en: But there would not come to them a prophet except that they used to ridicule him.

source: فأهلكنا أشد منهم بطشا ومضى مثل الأولين
en: And We destroyed greater than them in [striking] power, and the example of the former peoples has preceded.

source: ولئن سألتهم من خلق السماوات والأرض ليقولن خلقهن العزيز العليم
en: And if you should ask them, "Who has created the heavens and the earth?" they would surely say, "They were created by the Exalted in Might, the Knowing."

source: الذي جعل لكم الأرض مهدا وجعل لكم فيها سبلا لعلكم تهتدون
en: [The one] who has made for you the earth a bed and made for you upon it roads that you might be guided

source: والذي نزل من السماء ماء بقدر فأنشرنا به بلدة ميتا كذلك تخرجون
en: And who sends down rain from the sky in measured amounts, and We revive thereby a dead land - thus will you be brought forth -

source: والذي خلق الأزواج كلها وجعل لكم من الفلك والأنعام ما تركبون
en: And who created the species, all of them, and has made for you of ships and animals those which you mount.

source: لتستووا على ظهوره ثم تذكروا نعمة ربكم إذا استويتم عليه وتقولوا سبحان الذي سخر لنا هذا وما كنا له مقرنين
en: That you may settle yourselves upon their backs and then remember the favor of your Lord when you have settled upon them and say. "Exalted is He who has subjected this to us, and we could not have [otherwise] subdued it.

source: وإنا إلى ربنا لمنقلبون
en: And indeed we, to our Lord, will [surely] return."

source: وجعلوا له من عباده جزءا إن الإنسان لكفور مبين
en: But they have attributed to Him from His servants a portion. Indeed, man is clearly ungrateful.

source: أم اتخذ مما يخلق بنات وأصفاكم بالبنين
en: Or has He taken, out of what He has created, daughters and chosen you for [having] sons?

source: وإذا بشر أحدهم بما ضرب للرحمن مثلا ظل وجهه مسودا وهو كظيم
en: And when one of them is given good tidings of that which he attributes to the Most Merciful in comparison, his face becomes dark, and he suppresses grief.

source: أومن ينشأ في الحلية وهو في الخصام غير مبين
en: So is one brought up in ornaments while being during conflict unevident [attributed to Allah]?

source: وجعلوا الملائكة الذين هم عباد الرحمن إناثا أشهدوا خلقهم ستكتب شهادتهم ويسألون
en: And they have made the angels, who are servants of the Most Merciful, females. Did they witness their creation? Their testimony will be recorded, and they will be questioned.

source: وقالوا لو شاء الرحمن ما عبدناهم ما لهم بذلك من علم إن هم إلا يخرصون
en: And they said, "If the Most Merciful had willed, we would not have worshipped them." They have of that no knowledge. They are not but falsifying.

source: أم آتيناهم كتابا من قبله فهم به مستمسكون
en: Or have We given them a book before the Qur'an to which they are adhering?

source: بل قالوا إنا وجدنا آباءنا على أمة وإنا على آثارهم مهتدون
en: Rather, they say, "Indeed, we found our fathers upon a religion, and we are in their footsteps [rightly] guided."

source: وكذلك ما أرسلنا من قبلك في قرية من نذير إلا قال مترفوها إنا وجدنا آباءنا على أمة وإنا على آثارهم مقتدون
en: And similarly, We did not send before you any warner into a city except that its affluent said, "Indeed, we found our fathers upon a religion, and we are, in their footsteps, following."

source: قال أولو جئتكم بأهدى مما وجدتم عليه آباءكم قالوا إنا بما أرسلتم به كافرون
en: [Each warner] said, "Even if I brought you better guidance than that [religion] upon which you found your fathers?" They said, "Indeed we, in that with which you were sent, are disbelievers."

source: فانتقمنا منهم فانظر كيف كان عاقبة المكذبين
en: So we took retribution from them; then see how was the end of the deniers.

source: وإذ قال إبراهيم لأبيه وقومه إنني براء مما تعبدون
en: And [mention, O Muhammad], when Abraham said to his father and his people, "Indeed, I am disassociated from that which you worship

source: إلا الذي فطرني فإنه سيهدين
en: Except for He who created me; and indeed, He will guide me."

source: وجعلها كلمة باقية في عقبه لعلهم يرجعون
en: And he made it a word remaining among his descendants that they might return [to it].

source: بل متعت هؤلاء وآباءهم حتى جاءهم الحق ورسول مبين
en: However, I gave enjoyment to these [people of Makkah] and their fathers until there came to them the truth and a clear Messenger.

source: ولما جاءهم الحق قالوا هذا سحر وإنا به كافرون
en: But when the truth came to them, they said, "This is magic, and indeed we are, concerning it, disbelievers."

source: وقالوا لولا نزل هذا القرآن على رجل من القريتين عظيم
en: And they said, "Why was this Qur'an not sent down upon a great man from [one of] the two cities?"

source: أهم يقسمون رحمت ربك نحن قسمنا بينهم معيشتهم في الحياة الدنيا ورفعنا بعضهم فوق بعض درجات ليتخذ بعضهم بعضا سخريا ورحمت ربك خير مما يجمعون
en: Do they distribute the mercy of your Lord? It is We who have apportioned among them their livelihood in the life of this world and have raised some of them above others in degrees [of rank] that they may make use of one another for service. But the mercy of your Lord is better than whatever they accumulate.

source: ولولا أن يكون الناس أمة واحدة لجعلنا لمن يكفر بالرحمن لبيوتهم سقفا من فضة ومعارج عليها يظهرون
en: And if it were not that the people would become one community [of disbelievers], We would have made for those who disbelieve in the Most Merciful - for their houses - ceilings and stairways of silver upon which to mount

source: ولبيوتهم أبوابا وسررا عليها يتكئون
en: And for their houses - doors and couches [of silver] upon which to recline

source: وزخرفا وإن كل ذلك لما متاع الحياة الدنيا والآخرة عند ربك للمتقين
en: And gold ornament. But all that is not but the enjoyment of worldly life. And the Hereafter with your Lord is for the righteous.

source: ومن يعش عن ذكر الرحمن نقيض له شيطانا فهو له قرين
en: And whoever is blinded from remembrance of the Most Merciful - We appoint for him a devil, and he is to him a companion.

source: وإنهم ليصدونهم عن السبيل ويحسبون أنهم مهتدون
en: And indeed, the devils avert them from the way [of guidance] while they think that they are [rightly] guided

source: حتى إذا جاءنا قال يا ليت بيني وبينك بعد المشرقين فبئس القرين
en: Until, when he comes to Us [at Judgement], he says [to his companion], "Oh, I wish there was between me and you the distance between the east and west - how wretched a companion."

source: ولن ينفعكم اليوم إذ ظلمتم أنكم في العذاب مشتركون
en: And never will it benefit you that Day, when you have wronged, that you are [all] sharing in the punishment.

source: أفأنت تسمع الصم أو تهدي العمي ومن كان في ضلال مبين
en: Then will you make the deaf hear, [O Muhammad], or guide the blind or he who is in clear error?

source: فإما نذهبن بك فإنا منهم منتقمون
en: And whether [or not] We take you away [in death], indeed, We will take retribution upon them.

source: أو نرينك الذي وعدناهم فإنا عليهم مقتدرون
en: Or whether [or not] We show you that which We have promised them, indeed, We are Perfect in Ability.

source: فاستمسك بالذي أوحي إليك إنك على صراط مستقيم
en: So adhere to that which is revealed to you. Indeed, you are on a straight path.

source: وإنه لذكر لك ولقومك وسوف تسألون
en: And indeed, it is a remembrance for you and your people, and you [all] are going to be questioned.

source: واسأل من أرسلنا من قبلك من رسلنا أجعلنا من دون الرحمن آلهة يعبدون
en: And ask those We sent before you of Our messengers; have We made besides the Most Merciful deities to be worshipped?

source: ولقد أرسلنا موسى بآياتنا إلى فرعون وملئه فقال إني رسول رب العالمين
en: And certainly did We send Moses with Our signs to Pharaoh and his establishment, and he said, "Indeed, I am the messenger of the Lord of the worlds."

source: فلما جاءهم بآياتنا إذا هم منها يضحكون
en: But when he brought them Our signs, at once they laughed at them.

source: وما نريهم من آية إلا هي أكبر من أختها وأخذناهم بالعذاب لعلهم يرجعون
en: And We showed them not a sign except that it was greater than its sister, and We seized them with affliction that perhaps they might return [to faith].

source: وقالوا يا أيه الساحر ادع لنا ربك بما عهد عندك إننا لمهتدون
en: And they said [to Moses], "O magician, invoke for us your Lord by what He has promised you. Indeed, we will be guided."

source: فلما كشفنا عنهم العذاب إذا هم ينكثون
en: But when We removed from them the affliction, at once they broke their word.

source: ونادى فرعون في قومه قال يا قوم أليس لي ملك مصر وهذه الأنهار تجري من تحتي أفلا تبصرون
en: And Pharaoh called out among his people; he said, "O my people, does not the kingdom of Egypt belong to me, and these rivers flowing beneath me; then do you not see?

source: أم أنا خير من هذا الذي هو مهين ولا يكاد يبين
en: Or am I [not] better than this one who is insignificant and hardly makes himself clear?

source: فلولا ألقي عليه أسورة من ذهب أو جاء معه الملائكة مقترنين
en: Then why have there not been placed upon him bracelets of gold or come with him the angels in conjunction?"

source: فاستخف قومه فأطاعوه إنهم كانوا قوما فاسقين
en: So he bluffed his people, and they obeyed him. Indeed, they were [themselves] a people defiantly disobedient [of Allah].

source: فلما آسفونا انتقمنا منهم فأغرقناهم أجمعين
en: And when they angered Us, We took retribution from them and drowned them all.

source: فجعلناهم سلفا ومثلا للآخرين
en: And We made them a precedent and an example for the later peoples.

source: ولما ضرب ابن مريم مثلا إذا قومك منه يصدون
en: And when the son of Mary was presented as an example, immediately your people laughed aloud.

source: وقالوا أآلهتنا خير أم هو ما ضربوه لك إلا جدلا بل هم قوم خصمون
en: And they said, "Are your gods better, or is he?" They did not present the comparison except for [mere] argument. But, [in fact], they are a people prone to dispute.

source: إن هو إلا عبد أنعمنا عليه وجعلناه مثلا لبني إسرائيل
en: Jesus was not but a servant upon whom We bestowed favor, and We made him an example for the Children of Israel.

source: ولو نشاء لجعلنا منكم ملائكة في الأرض يخلفون
en: And if We willed, We could have made [instead] of you angels succeeding [one another] on the earth.

source: وإنه لعلم للساعة فلا تمترن بها واتبعون هذا صراط مستقيم
en: And indeed, Jesus will be [a sign for] knowledge of the Hour, so be not in doubt of it, and follow Me. This is a straight path.

source: ولا يصدنكم الشيطان إنه لكم عدو مبين
en: And never let Satan avert you. Indeed, he is to you a clear enemy.

source: ولما جاء عيسى بالبينات قال قد جئتكم بالحكمة ولأبين لكم بعض الذي تختلفون فيه فاتقوا الله وأطيعون
en: And when Jesus brought clear proofs, he said, "I have come to you with wisdom and to make clear to you some of that over which you differ, so fear Allah and obey me.

source: إن الله هو ربي وربكم فاعبدوه هذا صراط مستقيم
en: Indeed, Allah is my Lord and your Lord, so worship Him. This is a straight path."

source: فاختلف الأحزاب من بينهم فويل للذين ظلموا من عذاب يوم أليم
en: But the denominations from among them differed [and separated], so woe to those who have wronged from the punishment of a painful Day.

source: هل ينظرون إلا الساعة أن تأتيهم بغتة وهم لا يشعرون
en: Are they waiting except for the Hour to come upon them suddenly while they perceive not?

source: الأخلاء يومئذ بعضهم لبعض عدو إلا المتقين
en: Close friends, that Day, will be enemies to each other, except for the righteous

source: يا عباد لا خوف عليكم اليوم ولا أنتم تحزنون
en: [To whom Allah will say], "O My servants, no fear will there be concerning you this Day, nor will you grieve,

source: الذين آمنوا بآياتنا وكانوا مسلمين
en: [You] who believed in Our verses and were Muslims.

source: ادخلوا الجنة أنتم وأزواجكم تحبرون
en: Enter Paradise, you and your kinds, delighted."

source: يطاف عليهم بصحاف من ذهب وأكواب وفيها ما تشتهيه الأنفس وتلذ الأعين وأنتم فيها خالدون
en: Circulated among them will be plates and vessels of gold. And therein is whatever the souls desire and [what] delights the eyes, and you will abide therein eternally.

source: وتلك الجنة التي أورثتموها بما كنتم تعملون
en: And that is Paradise which you are made to inherit for what you used to do.

source: لكم فيها فاكهة كثيرة منها تأكلون
en: For you therein is much fruit from which you will eat.

source: إن المجرمين في عذاب جهنم خالدون
en: Indeed, the criminals will be in the punishment of Hell, abiding eternally.

source: لا يفتر عنهم وهم فيه مبلسون
en: It will not be allowed to subside for them, and they, therein, are in despair.

source: وما ظلمناهم ولكن كانوا هم الظالمين
en: And We did not wrong them, but it was they who were the wrongdoers.

source: ونادوا يا مالك ليقض علينا ربك قال إنكم ماكثون
en: And they will call, "O Malik, let your Lord put an end to us!" He will say, "Indeed, you will remain."

source: لقد جئناكم بالحق ولكن أكثركم للحق كارهون
en: We had certainly brought you the truth, but most of you, to the truth, were averse.

source: أم أبرموا أمرا فإنا مبرمون
en: Or have they devised [some] affair? But indeed, We are devising [a plan].

source: أم يحسبون أنا لا نسمع سرهم ونجواهم بلى ورسلنا لديهم يكتبون
en: Or do they think that We hear not their secrets and their private conversations? Yes, [We do], and Our messengers are with them recording.

source: قل إن كان للرحمن ولد فأنا أول العابدين
en: Say, [O Muhammad], "If the Most Merciful had a son, then I would be the first of [his] worshippers."

source: سبحان رب السماوات والأرض رب العرش عما يصفون
en: Exalted is the Lord of the heavens and the earth, Lord of the Throne, above what they describe.

source: فذرهم يخوضوا ويلعبوا حتى يلاقوا يومهم الذي يوعدون
en: So leave them to converse vainly and amuse themselves until they meet their Day which they are promised.

source: وهو الذي في السماء إله وفي الأرض إله وهو الحكيم العليم
en: And it is Allah who is [the only] deity in the heaven, and on the earth [the only] deity. And He is the Wise, the Knowing.
